## Brewfile
##

# 'brew tap'
tap 'homebrew/cask'
tap 'FelixKratz/formulae'

# 'brew install'
brew 'eza'
brew 'jq'
brew 'fastlane'
brew 'git-delta'
brew 'rbenv'
brew 'pyenv'
brew 'powerlevel10k'
brew 'zsh-autosuggestions'
brew 'xclogparser'
brew 'aircrack-ng'
brew 'xcbeautify'
brew 'swiftlint'
brew 'gh'
brew 'bat'
brew 'borders'

# 'brew casks'
cask "iterm2"
cask "proxyman"
cask "xcodes"
cask "docker"
cask "rectangle"
cask "keepingyouawake"
cask "visual-studio-code"
cask "nikitabobko/tap/aerospace"