## Brewfile
##

# JankyBorders formulae tap
brew tap FelixKratz/formulae

# Essential CLI Tools
brew 'bat'              # Better cat with syntax highlighting
brew 'eza'              # Modern ls replacement
brew 'fzf'              # Fuzzy finder - essential for productivity
brew 'ripgrep'          # Better grep (rg command)
brew 'fd'               # Better find
brew 'jq'               # JSON processor
brew 'htop'             # Interactive process viewer
brew 'tree'             # Directory visualization
brew 'httpie'           # Better curl alternative
brew 'wget'             # Download utility
brew 'curl'             # HTTP client

# Development Tools
brew 'git-delta'        # Better git diff
brew 'gh'               # GitHub CLI
brew 'fastlane'         # iOS automation
brew 'rbenv'            # Ruby version manager
brew 'pyenv'            # Python version manager

# Shell Enhancement
brew 'powerlevel10k'             # Zsh theme
brew 'zsh-autosuggestions'       # Zsh autosuggestions
brew 'zsh-syntax-highlighting'   # Zsh syntax highlighting

# iOS Development
brew 'xclogparser'      # Xcode log parser
brew 'xcbeautify'       # Xcode output formatter
brew 'swiftlint'        # Swift linter

# System & Network
brew 'aircrack-ng'      # Network security tools
brew 'mas'              # Mac App Store CLI

# Applications
# Development
cask "visual-studio-code"         # Code editor
cask "xcodes"                     # Xcode installer
cask "docker"                     # Containerization

# Terminal & Shell
cask "iterm2"                     # Terminal emulator

# Productivity
cask "keepingyouawake"            # Prevent sleep
brew 'borders'                    # JankyBorders window borders
cask "nikitabobko/tap/aerospace"  # Tiling window manager

# Media
cask "imagemagick"

# Network & API
cask "proxyman"                   # HTTP debugging

# Fonts for Development
cask "font-jetbrains-mono-nerd-font"  # Programming font with icons
cask "font-fira-code-nerd-font"       # Alternative programming font
