## Brewfile
##

# 'brew tap'
tap 'homebrew/cask'

# 'brew install'
brew 'exa'
brew 'fastlane'
brew 'git-delta'
brew 'rbenv'
brew 'pyenv'
brew 'powerlevel10k'
brew 'xclogparser'
brew 'jq'
brew 'aircrack-ng'

# 'brew casks'
cask "iterm2"
cask "proxyman"
cask "xcodes"
cask "docker"
cask "rectangle"
cask "keepingyouawake"
cask "visual-studio-code"